print("\n" , '-' * 30, "3.42 - 3.51", '-' * 30, "\n")


def task_3_42(a2, a1, b):
    number1 = a2 * 10 + a1  # Двузначное число
    number2 = b  # Однозначное число
    result = number1 + number2  # Их сумма
    
    # Разделение результата на десятки и единицы
    d2 = result // 10
    d1 = result % 10
    return d2, d1



#------------------------------------------------------------------------#
a2, a1, b = map(int, input("Введите a2, a1, b через пробел: ").split())
d2, d1 = task_3_42(a2, a1, b)
print(f"Цифры результата: десятки = {d2}, единицы = {d1}")